
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
//проверить реквизит СуммаПоДокументу
	Если СуммаПоДокументу = 0 Тогда
		сообщение = новый СообщениеПользователю;
		сообщение.Текст = "Не заполнена сумма по документу";
		сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;


КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//добавить цикл для запись в регистр накопления ОстаткиНоменклатуры из табличной части документа
	Для каждого СтрокаТЧ из СписокНоменклатуры Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		Движение.Количество = СтрокаТЧ.Количество;
	КонецЦикла;
 
КонецПроцедуры
